app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = '7'
---
    public function profile()
    {
        // Pastikan user sudah login
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/auth/login');
        }

        $userId = session()->get('id');
        $user = $this->userModel->find($userId);