app/Models/BookModel.php

SELECT *
FROM `books`
WHERE `status` = 'active'
---
    public function getActiveBooks()
    {
        return $this->where('status', 'active')->findAll();

SELECT DISTINCT `category`
FROM `books`
WHERE `category` IS NOT NULL
AND `category` != ''
ORDER BY `category` ASC
---
    public function getBookCategories()
    {
        return $this->select('category')
                    ->distinct()
                    ->where('category IS NOT NULL')
                    ->where('category !=', '')
                    ->orderBy('category', 'ASC')
                    ->findAll();

SELECT *
FROM `books`
ORDER BY `created_at` DESC
 LIMIT 8
---
    public function getRecentBooks($limit = 5)
    {
        try {
            return $this->orderBy('created_at', 'DESC')
                       ->limit($limit)
                       ->findAll();