app/Models/CartModel.php

SELECT `cart_items`.*, `books`.`title`, `books`.`author`, `books`.`price`, `books`.`cover_image`, `books`.`stock`
FROM `cart_items`
JOIN `books` ON `books`.`id` = `cart_items`.`book_id`
WHERE `cart_items`.`user_id` = 7
---
    public function getCartItemsByUser($userId)
    {
        $userId = (int) $userId; // Type cast

        // REMOVED books.status condition since the column doesn't exist
        return $this->select('cart_items.*, books.title, books.author, books.price, books.cover_image, books.stock')
                    ->join('books', 'books.id = cart_items.book_id')
                    ->where('cart_items.user_id', $userId)
                    ->findAll();