app/Models/UserModel.php

    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'A@GMAIK.COM'
 LIMIT 1